{
  "positive": [
    "Keep pushing forward, you're doing amazing!",
    "Your energy is contagious—keep spreading that positivity!",
    "You're crushing it! Keep riding that wave of success!",
    "Keep the momentum going, you're on fire!",
    "Believe in your ability to accomplish anything—you've proven it!",
    "You're unstoppable—keep shining bright!",
    "Every step you take is a step closer to greatness!",
    "Your hard work is paying off—keep it up!",
    "You're a beacon of positivity—keep inspiring others!",
    "Success is yours for the taking—go for it!",
    "Dream big and dare to achieve. You're capable of incredible things!",
    "You light up every room you walk into—keep that energy flowing.",
    "Success is not by chance; it's by choice. You're choosing greatness every day.",
    "Keep moving forward, even when it's tough. Progress is progress.",
    "Your dreams are valid, and you're on the path to making them real.",
    "You are the author of your story—make it a bestseller.",
    "Your positive energy is contagious. The world is better because of you.",
    "Nothing is out of reach when you're this determined.",
    "When you believe in yourself, amazing things happen.",
    "Keep striving, keep pushing, keep achieving. You're on fire!",
    "Your hard work is paving the way for something great.",
    "You're setting the standard for what it means to be unstoppable.",
    "Keep aiming high—your potential is limitless.",
    "The journey to success is long, but you're making every step count.",
    "You're turning your dreams into plans and your plans into reality.",
    "Never forget how far you've come and how much you can still achieve.",
    "You're writing your own success story one day at a time.",
    "Your passion and drive are inspiring those around you.",
    "Keep the faith. What you're working for is worth the effort.",
    "You're proving that persistence and passion are a powerful combination.",
    "Keep going. Every effort is building toward something amazing.",
    "Believe in your abilities—you're stronger than you think.",
    "Your determination is inspiring others to dream bigger.",
    "When you show up with positivity, you change everything around you.",
    "You're living proof that hard work and optimism pay off.",
    "The best view comes after the hardest climb—keep going.",
    "You're setting the pace for others to follow—keep leading the way.",
    "You're moving mountains with your determination and strength.",
    "Keep chasing your dreams—they're closer than you think.",
    "You're unstoppable when you're focused and driven.",
    "Keep going. The best is yet to come, and you're heading right for it.",
    "You're not just dreaming of success—you're making it happen.",
    "Your energy is magnetic—people are inspired by your drive.",
    "You are capable of more than you ever imagined.",
    "Your passion and perseverance are making waves.",
    "Every small step you take is progress. Keep stepping forward.",
    "You're proving that hard work truly does pay off.",
    "Your positive attitude is your superpower—keep using it.",
    "You're building something amazing, one day at a time.",
    "Keep moving forward. Great things are just around the corner.",
    "You're turning obstacles into opportunities—keep it up.",
    "Your success story is unfolding beautifully.",
    "Your strength and courage inspire those around you.",
    "Keep pushing through—you're stronger than any challenge.",
    "You're creating the life you've always dreamed of.",
    "Your work ethic is unmatched—keep setting that example.",
    "You're reaching new heights—don't look back.",
    "Keep going. You're making more progress than you realize.",
    "Your persistence is proof of your greatness.",
    "You're turning your dreams into achievements.",
    "Every day you're becoming a better version of yourself.",
    "You're on the right path—keep trusting your journey.",
    "Your positivity is like a ripple, spreading good vibes everywhere.",
    "You're inspiring others by simply being yourself.",
    "Keep pushing boundaries—you're meant for big things.",
    "Your ambition is contagious. Keep spreading that drive.",
    "You're a leader by action. Keep setting the example.",
    "You're not just meeting your goals—you're exceeding them.",
    "The world needs more of your energy—keep shining.",
    "You're climbing the ladder of success with every step.",
    "You're unstoppable when you believe in yourself.",
    "Your hard work is building a legacy—keep it going.",
    "You're reaching new levels of greatness every day.",
    "You're showing everyone what determination looks like.",
    "Your journey is proof that dedication pays off.",
    "You're making things happen—keep pushing forward.",
    "Your focus and drive are setting you up for success.",
    "You're paving the way for your own success—keep moving.",
    "You're achieving greatness, one step at a time.",
    "You're building momentum—keep going strong.",
    "Your resilience is your superpower. Keep moving forward.",
    "You're laying the foundation for a successful future.",
    "You're proving that consistency is the key to success.",
    "You're turning your goals into reality—keep going.",
    "Your ambition is inspiring others to dream bigger.",
    "You're creating opportunities where others see obstacles.",
    "You're mastering the art of persistence—keep it up.",
    "You're not just dreaming of success—you're living it.",
    "Your hard work is creating a path for your dreams.",
    "You're moving forward with purpose—keep that momentum.",
    "You're a force of nature—unstoppable and inspiring.",
    "Your dedication is turning dreams into reality.",
    "You're building a life that you're proud of—keep going.",
    "You're showing the world what's possible when you believe.",
    "Your progress is inspiring others to chase their dreams.",
    "You're unlocking new potential every single day.",
    "Your energy and drive are pushing you towards greatness.",
    "You're redefining what it means to be successful.",
    "You're proving that anything is possible with hard work.",
    "Your confidence is leading you to great places.",
    "You're building your own path to success—keep moving forward.",
    "Your journey is inspiring others to follow their dreams.",
    "You're setting new standards for excellence—keep it up."
  ],
  "neutral": [
    "Remember, consistency is key. Progress is made step by step.",
    "Every day is another chance to build the life you want.",
    "Even the small steps count—keep moving forward.",
    "It's not always about big wins; it's about steady progress.",
    "Focus on the process, the results will come.",
    "Patience and persistence are your greatest allies.",
    "Every journey begins with a single step—keep walking.",
    "Take it one day at a time; progress is still progress.",
    "Stay steady and trust the process.",
    "Small efforts compound into big results over time.",
    "One step at a time, and you'll get there eventually.",
    "Not every day is perfect, but every day is progress.",
    "Sometimes, just showing up is enough.",
    "It's okay to take things slow—progress is progress.",
    "The path forward isn't always clear, but it's still a path.",
    "Every decision you make shapes the path ahead.",
    "Focus on what you can control, and let go of what you can't.",
    "Adjusting the plan doesn't mean you've failed.",
    "Growth is not always visible, but it's always happening.",
    "Sometimes, reflection is as important as action.",
    "There are lessons to be learned in both successes and failures.",
    "Change happens gradually—keep moving forward.",
    "The process is just as important as the outcome.",
    "A steady pace is better than no pace at all.",
    "Take a moment to breathe; everything will work out in time.",
    "Progress isn't always linear—just keep going.",
    "Sometimes you move forward, sometimes you take a step back. Both are part of growth.",
    "Even small improvements add up over time.",
    "Your journey is unique; compare only to your past self.",
    "Obstacles are just part of the journey, not the end of it.",
    "Growth sometimes requires patience.",
    "Even slow progress is still progress.",
    "It's okay to pause; it's part of moving forward.",
    "Everything takes time—trust the process.",
    "Every effort counts, no matter how small.",
    "Keep moving, even if it's just a little bit every day.",
    "Learn from yesterday, prepare for tomorrow, act today.",
    "Focus on consistency, not perfection.",
    "Challenges are opportunities in disguise.",
    "You don't have to have it all figured out to move forward.",
    "Small steps forward are still steps forward.",
    "What you do consistently matters more than what you do occasionally.",
    "Progress is progress, no matter how slow.",
    "Every step you take brings you closer to your goals.",
    "You're always one step ahead of where you were yesterday.",
    "It's okay if progress is slow—just don't stop.",
    "Sometimes you just need to keep going, even when it's hard.",
    "Even when things are tough, you're still moving forward.",
    "Keep pushing through; it's all part of the process.",
    "There's value in every experience, good or bad.",
    "The journey is as important as the destination.",
    "You won't always see progress right away, but it's happening.",
    "Stay focused on what you can do right now.",
    "Progress isn't about speed; it's about direction.",
    "Consistency will always outlast intensity.",
    "Sometimes, doing your best means just showing up.",
    "Focus on the process, and the results will follow.",
    "Every effort you make is a step forward.",
    "Growth takes time; trust the journey.",
    "You're learning and improving with each step.",
    "Even if it feels slow, you're still moving forward.",
    "Keep your eyes on the next step, not the finish line.",
    "Sometimes the best thing you can do is just keep going.",
    "Trust that small steps add up over time.",
    "Even when progress is invisible, it's happening.",
    "Focus on the next step, not the entire journey.",
    "Consistency builds momentum over time.",
    "Every action you take shapes your future.",
    "It's not always easy, but it's always worth it.",
    "Growth is steady, not instant.",
    "Stay the course—progress takes time.",
    "There's value in persistence, even when it's hard.",
    "A steady pace is still progress.",
    "Keep building, brick by brick.",
    "What you do every day matters more than what you do once in a while.",
    "Even if it's slow, moving forward is what matters.",
    "It's okay if progress is gradual; just keep moving.",
    "Every effort counts, even the small ones.",
    "It's about the journey, not just the destination.",
    "Stay focused; progress takes time.",
    "The best things take time to build.",
    "Every step forward is progress.",
    "Focus on steady improvement, not perfection.",
    "You don't have to rush—just keep moving.",
    "Even slow growth is still growth.",
    "Keep moving forward; it will be worth it.",
    "The journey is long, but you're on the right path.",
    "Focus on building habits, not just reaching goals.",
    "Progress is about direction, not speed.",
    "Consistency is more important than intensity.",
    "Sometimes, just continuing is the most important part.",
    "Growth isn't always visible, but it's always happening.",
    "It's okay to move at your own pace.",
    "Trust the journey, even when it's hard to see progress.",
    "Focus on what you can do right now.",
    "Patience is part of progress.",
    "Every small step matters.",
    "Keep moving, even if it's slow.",
    "Consistency builds success over time.",
    "It's not about perfection; it's about persistence.",
    "Even small actions create change.",
    "Keep working at it; you're getting closer.",
    "Trust the process—it's part of growth.",
    "You're moving forward, even if it's slow.",
    "There's progress in every effort you make.",
    "Take your time; progress is still progress.",
    "Sometimes the best progress is made slowly and steadily.",
    "Keep pushing, even when it's tough.",
    "One day at a time, you're building something great."
  ],
  "negative": [
    "Every setback is a setup for a comeback. Keep going!",
    "Tough days are temporary. Strong people are forever.",
    "You have the power to turn things around. One step at a time.",
    "Growth comes from challenges. You're growing stronger every day.",
    "It's okay to feel down. What matters is you get back up.",
    "The darkest nights produce the brightest stars.",
    "Failure is not the end; it's a lesson in disguise.",
    "You are stronger than you think—keep fighting.",
    "Every storm runs out of rain. This too shall pass.",
    "Your struggles today are building your strength for tomorrow.",
    "Sometimes you have to lose to learn. Stay resilient.",
    "It's okay to stumble. What matters is that you get back up.",
    "Even the strongest feel weak sometimes. Take a breath and keep moving.",
    "Every challenge is a chance to grow stronger.",
    "It's hard now, but it won't be like this forever.",
    "Don't let a bad day make you feel like you have a bad life.",
    "Sometimes falling down is the only way to rise even higher.",
    "Keep pushing through. The breakthrough is closer than you think.",
    "When you feel like giving up, remember why you started.",
    "Struggles are proof that you're trying. Keep pushing.",
    "Your pain today will become your power tomorrow.",
    "You're not alone. Even the toughest days pass.",
    "Life isn't easy, but your strength will see you through.",
    "One rough day doesn't define your journey.",
    "Your strength is being tested, but you are tougher than this.",
    "Sometimes it's okay to just survive the day. Keep going.",
    "You can't change the past, but you can shape your future.",
    "Feeling lost means you're about to find something important.",
    "It's okay to rest, but don't quit.",
    "You have survived every bad day so far. You can survive this one too.",
    "Your current situation is not your final destination.",
    "Not every day is good, but there is something good in every day.",
    "You are allowed to struggle. You are allowed to take your time.",
    "Don't let today's failures define your tomorrow.",
    "Feeling down means you care. That's strength, not weakness.",
    "Even in the darkest moments, there's a light at the end.",
    "Your pain is temporary. Your perseverance is forever.",
    "Let your struggles teach you. You're stronger than your doubts.",
    "Sometimes the hardest battles bring the best victories.",
    "Don't give up. Great things take time.",
    "You might be down, but you're not out. Keep going.",
    "When life knocks you down, rise stronger.",
    "Healing takes time. Be patient with yourself.",
    "Your mistakes do not define you. Learn and move forward.",
    "You have faced difficulties before. You'll overcome this too.",
    "Some days are tough, but so are you.",
    "You can't control everything. Focus on what you can change.",
    "One bad day doesn't mean a bad life. You're resilient.",
    "You're more capable than your struggles make you feel.",
    "When things get tough, remember your strength.",
    "The road is rough now, but it leads to a brighter future.",
    "You've been through worse. You can handle this.",
    "Sometimes all you can do is keep breathing and keep moving.",
    "Every hard moment is making you stronger.",
    "When your spirit feels broken, remember it can heal.",
    "Your courage shines brightest in your darkest moments.",
    "You might feel stuck, but you're growing through this.",
    "Even small steps forward count. Keep moving.",
    "Feeling overwhelmed is normal. Take one thing at a time.",
    "Some struggles are blessings in disguise. Stay strong.",
    "You're allowed to have bad days. Just don't give up.",
    "Difficult roads lead to beautiful destinations.",
    "Your journey is unique. Don't compare your struggles to others.",
    "When you can't see the light, just keep moving forward.",
    "Sometimes progress looks like surviving. Keep pushing.",
    "Your fight is valid, and your effort is enough.",
    "You're not failing—you're learning.",
    "It's okay to feel low. Just don't let it consume you.",
    "Hold on to hope, even when it feels out of reach.",
    "You're allowed to cry, but don't forget to stand up again.",
    "This moment is hard, but it's shaping you for the better.",
    "You're more than your struggles. You're a fighter.",
    "You can't control the storm, but you can weather it.",
    "Pain is temporary, but your strength is permanent.",
    "When life tests you, prove your resilience.",
    "Keep going, even if progress feels slow.",
    "Your heart is strong enough to handle this.",
    "You are not your failures. You are your perseverance.",
    "The hardest times often lead to the best growth.",
    "You've made it through before. You'll make it through again.",
    "When everything feels heavy, take it one breath at a time.",
    "You may feel weak now, but you are growing stronger.",
    "When life feels dark, remember that dawn is coming.",
    "Don't lose hope. Better days are on their way.",
    "It's okay to be tired. Just don't give up.",
    "You're allowed to feel hurt. Just remember to heal too.",
    "You're more than the pain you feel. You are hope.",
    "Keep fighting for yourself, even when it's hard.",
    "When life is overwhelming, focus on one small victory.",
    "Every challenge you face adds to your strength.",
    "It's okay to struggle, but don't give in.",
    "You are more resilient than your obstacles.",
    "Even the strongest trees bend in the wind. You will stand tall again.",
    "You may be struggling, but you are not defeated.",
    "Your spirit is unbreakable, even when it feels shattered.",
    "Life is testing you because you're capable of passing.",
    "When you feel weak, remember how far you've come.",
    "You are allowed to feel pain, but you are destined to overcome.",
    "Even on your worst days, your worth doesn't change.",
    "You can't rush healing. Take it one step at a time.",
    "You are enough, even when you feel broken.",
    "Don't be afraid to start over. You're building something stronger.",
    "You are allowed to take a break, but don't give up.",
    "Your story isn't over yet. Keep writing it."
  ]
}
